kbecker0619/StateMachineEngine/components/cwsw_arch_prj/cwsw_arch/MPC57xx/include/MPC5748G_defines_2.h
#define CAN_4_W47            CAN_4.MB[47].DATA.W           /* Message Buffer 47 W Register */
#define CAN_4_CS48           CAN_4.MB[48].CS.R             /* Message Buffer 48 CS Register */
#define CAN_4_ID48           CAN_4.MB[48].ID.R             /* Message Buffer 48 ID Register */
#define CAN_4_B48            CAN_4.MB[48].DATA.B           /* Message Buffer 48 B Register */
#define CAN_4_H48            CAN_4.MB[48].DATA.H           /* Message Buffer 48 H Register */
#define CAN_4_W48            CAN_4.MB[48].DATA.W           /* Message Buffer 48 W Register */
#define CAN_4_CS49           CAN_4.MB[49].CS.R             /* Message Buffer 49 CS Register */
#define CAN_4_ID49           CAN_4.MB[49].ID.R             /* Message Buffer 49 ID Register */
#define CAN_4_B49            CAN_4.MB[49].DATA.B           /* Message Buffer 49 B Register */
#define CAN_4_H49            CAN_4.MB[49].DATA.H           /* Message Buffer 49 H Register */
#define CAN_4_W49            CAN_4.MB[49].DATA.W           /* Message Buffer 49 W Register */
#define CAN_4_CS50           CAN_4.MB[50].CS.R             /* Message Buffer 50 CS Register */
#define CAN_4_ID50           CAN_4.MB[50].ID.R             /* Message Buffer 50 ID Register */
#define CAN_4_B50            CAN_4.MB[50].DATA.B           /* Message Buffer 50 B Register */
#define CAN_4_H50            CAN_4.MB[50].DATA.H           /* Message Buffer 50 H Register */
#define CAN_4_W50            CAN_4.MB[50].DATA.W           /* Message Buffer 50 W Register */
#define CAN_4_CS51           CAN_4.MB[51].CS.R             /* Message Buffer 51 CS Register */
#define CAN_4_ID51           CAN_4.MB[51].ID.R             /* Message Buffer 51 ID Register */
#define CAN_4_B51            CAN_4.MB[51].DATA.B           /* Message Buffer 51 B Register */
#define CAN_4_H51            CAN_4.MB[51].DATA.H           /* Message Buffer 51 H Register */
#define CAN_4_W51            CAN_4.MB[51].DATA.W           /* Message Buffer 51 W Register */
#define CAN_4_CS52           CAN_4.MB[52].CS.R             /* Message Buffer 52 CS Register */
#define CAN_4_ID52           CAN_4.MB[52].ID.R             /* Message Buffer 52 ID Register */
#define CAN_4_B52            CAN_4.MB[52].DATA.B           /* Message Buffer 52 B Register */
#define CAN_4_H52            CAN_4.MB[52].DATA.H           /* Message Buffer 52 H Register */
#define CAN_4_W52            CAN_4.MB[52].DATA.W           /* Message Buffer 52 W Register */
#define CAN_4_CS53           CAN_4.MB[53].CS.R             /* Message Buffer 53 CS Register */
#define CAN_4_ID53           CAN_4.MB[53].ID.R             /* Message Buffer 53 ID Register */
#define CAN_4_B53            CAN_4.MB[53].DATA.B           /* Message Buffer 53 B Register */
#define CAN_4_H53            CAN_4.MB[53].DATA.H           /* Message Buffer 53 H Register */
#define CAN_4_W53            CAN_4.MB[53].DATA.W           /* Message Buffer 53 W Register */
#define CAN_4_CS54           CAN_4.MB[54].CS.R             /* Message Buffer 54 CS Register */
#define CAN_4_ID54           CAN_4.MB[54].ID.R             /* Message Buffer 54 ID Register */
#define CAN_4_B54            CAN_4.MB[54].DATA.B           /* Message Buffer 54 B Register */
#define CAN_4_H54            CAN_4.MB[54].DATA.H           /* Message Buffer 54 H Register */
#define CAN_4_W54            CAN_4.MB[54].DATA.W           /* Message Buffer 54 W Register */
#define CAN_4_CS55           CAN_4.MB[55].CS.R             /* Message Buffer 55 CS Register */
#define CAN_4_ID55           CAN_4.MB[55].ID.R             /* Message Buffer 55 ID Register */
#define CAN_4_B55            CAN_4.MB[55].DATA.B           /* Message Buffer 55 B Register */
#define CAN_4_H55            CAN_4.MB[55].DATA.H           /* Message Buffer 55 H Register */
#define CAN_4_W55            CAN_4.MB[55].DATA.W           /* Message Buffer 55 W Register */
#define CAN_4_CS56           CAN_4.MB[56].CS.R             /* Message Buffer 56 CS Register */
#define CAN_4_ID56           CAN_4.MB[56].ID.R             /* Message Buffer 56 ID Register */
#define CAN_4_B56            CAN_4.MB[56].DATA.B           /* Message Buffer 56 B Register */
#define CAN_4_H56            CAN_4.MB[56].DATA.H           /* Message Buffer 56 H Register */
#define CAN_4_W56            CAN_4.MB[56].DATA.W           /* Message Buffer 56 W Register */
#define CAN_4_CS57           CAN_4.MB[57].CS.R             /* Message Buffer 57 CS Register */
#define CAN_4_ID57           CAN_4.MB[57].ID.R             /* Message Buffer 57 ID Register */
#define CAN_4_B57            CAN_4.MB[57].DATA.B           /* Message Buffer 57 B Register */
#define CAN_4_H57            CAN_4.MB[57].DATA.H           /* Message Buffer 57 H Register */
#define CAN_4_W57            CAN_4.MB[57].DATA.W           /* Message Buffer 57 W Register */
#define CAN_4_CS58           CAN_4.MB[58].CS.R             /* Message Buffer 58 CS Register */
#define CAN_4_ID58           CAN_4.MB[58].ID.R             /* Message Buffer 58 ID Register */
#define CAN_4_B58            CAN_4.MB[58].DATA.B           /* Message Buffer 58 B Register */
#define CAN_4_H58            CAN_4.MB[58].DATA.H           /* Message Buffer 58 H Register */
#define CAN_4_W58            CAN_4.MB[58].DATA.W           /* Message Buffer 58 W Register */
#define CAN_4_CS59           CAN_4.MB[59].CS.R             /* Message Buffer 59 CS Register */
#define CAN_4_ID59           CAN_4.MB[59].ID.R             /* Message Buffer 59 ID Register */
#define CAN_4_B59            CAN_4.MB[59].DATA.B           /* Message Buffer 59 B Register */
#define CAN_4_H59            CAN_4.MB[59].DATA.H           /* Message Buffer 59 H Register */
#define CAN_4_W59            CAN_4.MB[59].DATA.W           /* Message Buffer 59 W Register */
#define CAN_4_CS60           CAN_4.MB[60].CS.R             /* Message Buffer 60 CS Register */
#define CAN_4_ID60           CAN_4.MB[60].ID.R             /* Message Buffer 60 ID Register */
#define CAN_4_B60            CAN_4.MB[60].DATA.B           /* Message Buffer 60 B Register */
#define CAN_4_H60            CAN_4.MB[60].DATA.H           /* Message Buffer 60 H Register */
#define CAN_4_W60            CAN_4.MB[60].DATA.W           /* Message Buffer 60 W Register */
#define CAN_4_CS61           CAN_4.MB[61].CS.R             /* Message Buffer 61 CS Register */
#define CAN_4_ID61           CAN_4.MB[61].ID.R             /* Message Buffer 61 ID Register */
#define CAN_4_B61            CAN_4.MB[61].DATA.B           /* Message Buffer 61 B Register */
#define CAN_4_H61            CAN_4.MB[61].DATA.H           /* Message Buffer 61 H Register */
#define CAN_4_W61            CAN_4.MB[61].DATA.W           /* Message Buffer 61 W Register */
#define CAN_4_CS62           CAN_4.MB[62].CS.R             /* Message Buffer 62 CS Register */
#define CAN_4_ID62           CAN_4.MB[62].ID.R             /* Message Buffer 62 ID Register */
#define CAN_4_B62            CAN_4.MB[62].DATA.B           /* Message Buffer 62 B Register */
#define CAN_4_H62            CAN_4.MB[62].DATA.H           /* Message Buffer 62 H Register */
#define CAN_4_W62            CAN_4.MB[62].DATA.W           /* Message Buffer 62 W Register */
#define CAN_4_CS63           CAN_4.MB[63].CS.R             /* Message Buffer 63 CS Register */
#define CAN_4_ID63           CAN_4.MB[63].ID.R             /* Message Buffer 63 ID Register */
#define CAN_4_B63            CAN_4.MB[63].DATA.B           /* Message Buffer 63 B Register */
#define CAN_4_H63            CAN_4.MB[63].DATA.H           /* Message Buffer 63 H Register */
#define CAN_4_W63            CAN_4.MB[63].DATA.W           /* Message Buffer 63 W Register */
#define CAN_4_CS64           CAN_4.MB[64].CS.R             /* Message Buffer 64 CS Register */
#define CAN_4_ID64           CAN_4.MB[64].ID.R             /* Message Buffer 64 ID Register */
#define CAN_4_B64            CAN_4.MB[64].DATA.B           /* Message Buffer 64 B Register */
#define CAN_4_H64            CAN_4.MB[64].DATA.H           /* Message Buffer 64 H Register */
#define CAN_4_W64            CAN_4.MB[64].DATA.W           /* Message Buffer 64 W Register */
#define CAN_4_CS65           CAN_4.MB[65].CS.R             /* Message Buffer 65 CS Register */
#define CAN_4_ID65           CAN_4.MB[65].ID.R             /* Message Buffer 65 ID Register */
#define CAN_4_B65            CAN_4.MB[65].DATA.B           /* Message Buffer 65 B Register */
#define CAN_4_H65            CAN_4.MB[65].DATA.H           /* Message Buffer 65 H Register */
#define CAN_4_W65            CAN_4.MB[65].DATA.W           /* Message Buffer 65 W Register */
#define CAN_4_CS66           CAN_4.MB[66].CS.R             /* Message Buffer 66 CS Register */
#define CAN_4_ID66           CAN_4.MB[66].ID.R             /* Message Buffer 66 ID Register */
#define CAN_4_B66            CAN_4.MB[66].DATA.B           /* Message Buffer 66 B Register */
#define CAN_4_H66            CAN_4.MB[66].DATA.H           /* Message Buffer 66 H Register */
#define CAN_4_W66            CAN_4.MB[66].DATA.W           /* Message Buffer 66 W Register */
#define CAN_4_CS67           CAN_4.MB[67].CS.R             /* Message Buffer 67 CS Register */
#define CAN_4_ID67           CAN_4.MB[67].ID.R             /* Message Buffer 67 ID Register */
#define CAN_4_B67            CAN_4.MB[67].DATA.B           /* Message Buffer 67 B Register */
#define CAN_4_H67            CAN_4.MB[67].DATA.H           /* Message Buffer 67 H Register */
#define CAN_4_W67            CAN_4.MB[67].DATA.W           /* Message Buffer 67 W Register */
#define CAN_4_CS68           CAN_4.MB[68].CS.R             /* Message Buffer 68 CS Register */
#define CAN_4_ID68           CAN_4.MB[68].ID.R             /* Message Buffer 68 ID Register */
#define CAN_4_B68            CAN_4.MB[68].DATA.B           /* Message Buffer 68 B Register */
#define CAN_4_H68            CAN_4.MB[68].DATA.H           /* Message Buffer 68 H Register */
#define CAN_4_W68            CAN_4.MB[68].DATA.W           /* Message Buffer 68 W Register */
#define CAN_4_CS69           CAN_4.MB[69].CS.R             /* Message Buffer 69 CS Register */
#define CAN_4_ID69           CAN_4.MB[69].ID.R             /* Message Buffer 69 ID Register */
#define CAN_4_B69            CAN_4.MB[69].DATA.B           /* Message Buffer 69 B Register */
#define CAN_4_H69            CAN_4.MB[69].DATA.H           /* Message Buffer 69 H Register */
#define CAN_4_W69            CAN_4.MB[69].DATA.W           /* Message Buffer 69 W Register */
#define CAN_4_CS70           CAN_4.MB[70].CS.R             /* Message Buffer 70 CS Register */
#define CAN_4_ID70           CAN_4.MB[70].ID.R             /* Message Buffer 70 ID Register */
#define CAN_4_B70            CAN_4.MB[70].DATA.B           /* Message Buffer 70 B Register */
#define CAN_4_H70            CAN_4.MB[70].DATA.H           /* Message Buffer 70 H Register */
#define CAN_4_W70            CAN_4.MB[70].DATA.W           /* Message Buffer 70 W Register */
#define CAN_4_CS71           CAN_4.MB[71].CS.R             /* Message Buffer 71 CS Register */
#define CAN_4_ID71           CAN_4.MB[71].ID.R             /* Message Buffer 71 ID Register */
#define CAN_4_B71            CAN_4.MB[71].DATA.B           /* Message Buffer 71 B Register */
#define CAN_4_H71            CAN_4.MB[71].DATA.H           /* Message Buffer 71 H Register */
#define CAN_4_W71            CAN_4.MB[71].DATA.W           /* Message Buffer 71 W Register */
#define CAN_4_CS72           CAN_4.MB[72].CS.R             /* Message Buffer 72 CS Register */
#define CAN_4_ID72           CAN_4.MB[72].ID.R             /* Message Buffer 72 ID Register */
#define CAN_4_B72            CAN_4.MB[72].DATA.B           /* Message Buffer 72 B Register */
#define CAN_4_H72            CAN_4.MB[72].DATA.H           /* Message Buffer 72 H Register */
#define CAN_4_W72            CAN_4.MB[72].DATA.W           /* Message Buffer 72 W Register */
#define CAN_4_CS73           CAN_4.MB[73].CS.R             /* Message Buffer 73 CS Register */
#define CAN_4_ID73           CAN_4.MB[73].ID.R             /* Message Buffer 73 ID Register */
#define CAN_4_B73            CAN_4.MB[73].DATA.B           /* Message Buffer 73 B Register */
#define CAN_4_H73            CAN_4.MB[73].DATA.H           /* Message Buffer 73 H Register */
#define CAN_4_W73            CAN_4.MB[73].DATA.W           /* Message Buffer 73 W Register */
#define CAN_4_CS74           CAN_4.MB[74].CS.R             /* Message Buffer 74 CS Register */
#define CAN_4_ID74           CAN_4.MB[74].ID.R             /* Message Buffer 74 ID Register */
#define CAN_4_B74            CAN_4.MB[74].DATA.B           /* Message Buffer 74 B Register */
#define CAN_4_H74            CAN_4.MB[74].DATA.H           /* Message Buffer 74 H Register */
#define CAN_4_W74            CAN_4.MB[74].DATA.W           /* Message Buffer 74 W Register */
#define CAN_4_CS75           CAN_4.MB[75].CS.R             /* Message Buffer 75 CS Register */
#define CAN_4_ID75           CAN_4.MB[75].ID.R             /* Message Buffer 75 ID Register */
#define CAN_4_B75            CAN_4.MB[75].DATA.B           /* Message Buffer 75 B Register */
#define CAN_4_H75            CAN_4.MB[75].DATA.H           /* Message Buffer 75 H Register */
#define CAN_4_W75            CAN_4.MB[75].DATA.W           /* Message Buffer 75 W Register */
#define CAN_4_CS76           CAN_4.MB[76].CS.R             /* Message Buffer 76 CS Register */
#define CAN_4_ID76           CAN_4.MB[76].ID.R             /* Message Buffer 76 ID Register */
#define CAN_4_B76            CAN_4.MB[76].DATA.B           /* Message Buffer 76 B Register */
#define CAN_4_H76            CAN_4.MB[76].DATA.H           /* Message Buffer 76 H Register */
#define CAN_4_W76            CAN_4.MB[76].DATA.W           /* Message Buffer 76 W Register */
#define CAN_4_CS77           CAN_4.MB[77].CS.R             /* Message Buffer 77 CS Register */
#define CAN_4_ID77           CAN_4.MB[77].ID.R             /* Message Buffer 77 ID Register */
#define CAN_4_B77            CAN_4.MB[77].DATA.B           /* Message Buffer 77 B Register */
#define CAN_4_H77            CAN_4.MB[77].DATA.H           /* Message Buffer 77 H Register */
#define CAN_4_W77            CAN_4.MB[77].DATA.W           /* Message Buffer 77 W Register */
#define CAN_4_CS78           CAN_4.MB[78].CS.R             /* Message Buffer 78 CS Register */
#define CAN_4_ID78           CAN_4.MB[78].ID.R             /* Message Buffer 78 ID Register */
#define CAN_4_B78            CAN_4.MB[78].DATA.B           /* Message Buffer 78 B Register */
#define CAN_4_H78            CAN_4.MB[78].DATA.H           /* Message Buffer 78 H Register */
#define CAN_4_W78            CAN_4.MB[78].DATA.W           /* Message Buffer 78 W Register */
#define CAN_4_CS79           CAN_4.MB[79].CS.R             /* Message Buffer 79 CS Register */
#define CAN_4_ID79           CAN_4.MB[79].ID.R             /* Message Buffer 79 ID Register */
#define CAN_4_B79            CAN_4.MB[79].DATA.B           /* Message Buffer 79 B Register */
#define CAN_4_H79            CAN_4.MB[79].DATA.H           /* Message Buffer 79 H Register */
#define CAN_4_W79            CAN_4.MB[79].DATA.W           /* Message Buffer 79 W Register */
#define CAN_4_CS80           CAN_4.MB[80].CS.R             /* Message Buffer 80 CS Register */
#define CAN_4_ID80           CAN_4.MB[80].ID.R             /* Message Buffer 80 ID Register */
#define CAN_4_B80            CAN_4.MB[80].DATA.B           /* Message Buffer 80 B Register */
#define CAN_4_H80            CAN_4.MB[80].DATA.H           /* Message Buffer 80 H Register */
#define CAN_4_W80            CAN_4.MB[80].DATA.W           /* Message Buffer 80 W Register */
#define CAN_4_CS81           CAN_4.MB[81].CS.R             /* Message Buffer 81 CS Register */
#define CAN_4_ID81           CAN_4.MB[81].ID.R             /* Message Buffer 81 ID Register */
#define CAN_4_B81            CAN_4.MB[81].DATA.B           /* Message Buffer 81 B Register */
#define CAN_4_H81            CAN_4.MB[81].DATA.H           /* Message Buffer 81 H Register */
#define CAN_4_W81            CAN_4.MB[81].DATA.W           /* Message Buffer 81 W Register */
#define CAN_4_CS82           CAN_4.MB[82].CS.R             /* Message Buffer 82 CS Register */
#define CAN_4_ID82           CAN_4.MB[82].ID.R             /* Message Buffer 82 ID Register */
#define CAN_4_B82            CAN_4.MB[82].DATA.B           /* Message Buffer 82 B Register */
#define CAN_4_H82            CAN_4.MB[82].DATA.H           /* Message Buffer 82 H Register */
#define CAN_4_W82            CAN_4.MB[82].DATA.W           /* Message Buffer 82 W Register */
#define CAN_4_CS83           CAN_4.MB[83].CS.R             /* Message Buffer 83 CS Register */
#define CAN_4_ID83           CAN_4.MB[83].ID.R             /* Message Buffer 83 ID Register */
#define CAN_4_B83            CAN_4.MB[83].DATA.B           /* Message Buffer 83 B Register */
#define CAN_4_H83            CAN_4.MB[83].DATA.H           /* Message Buffer 83 H Register */
#define CAN_4_W83            CAN_4.MB[83].DATA.W           /* Message Buffer 83 W Register */
#define CAN_4_CS84           CAN_4.MB[84].CS.R             /* Message Buffer 84 CS Register */
#define CAN_4_ID84           CAN_4.MB[84].ID.R             /* Message Buffer 84 ID Register */
#define CAN_4_B84            CAN_4.MB[84].DATA.B           /* Message Buffer 84 B Register */
#define CAN_4_H84            CAN_4.MB[84].DATA.H           /* Message Buffer 84 H Register */
#define CAN_4_W84            CAN_4.MB[84].DATA.W           /* Message Buffer 84 W Register */
#define CAN_4_CS85           CAN_4.MB[85].CS.R             /* Message Buffer 85 CS Register */
#define CAN_4_ID85           CAN_4.MB[85].ID.R             /* Message Buffer 85 ID Register */
#define CAN_4_B85            CAN_4.MB[85].DATA.B           /* Message Buffer 85 B Register */
#define CAN_4_H85            CAN_4.MB[85].DATA.H           /* Message Buffer 85 H Register */
#define CAN_4_W85            CAN_4.MB[85].DATA.W           /* Message Buffer 85 W Register */
#define CAN_4_CS86           CAN_4.MB[86].CS.R             /* Message Buffer 86 CS Register */
#define CAN_4_ID86           CAN_4.MB[86].ID.R             /* Message Buffer 86 ID Register */
#define CAN_4_B86            CAN_4.MB[86].DATA.B           /* Message Buffer 86 B Register */
#define CAN_4_H86            CAN_4.MB[86].DATA.H           /* Message Buffer 86 H Register */
#define CAN_4_W86            CAN_4.MB[86].DATA.W           /* Message Buffer 86 W Register */
#define CAN_4_CS87           CAN_4.MB[87].CS.R             /* Message Buffer 87 CS Register */
#define CAN_4_ID87           CAN_4.MB[87].ID.R             /* Message Buffer 87 ID Register */
#define CAN_4_B87            CAN_4.MB[87].DATA.B           /* Message Buffer 87 B Register */
#define CAN_4_H87            CAN_4.MB[87].DATA.H           /* Message Buffer 87 H Register */
#define CAN_4_W87            CAN_4.MB[87].DATA.W           /* Message Buffer 87 W Register */
#define CAN_4_CS88           CAN_4.MB[88].CS.R             /* Message Buffer 88 CS Register */
#define CAN_4_ID88           CAN_4.MB[88].ID.R             /* Message Buffer 88 ID Register */
#define CAN_4_B88            CAN_4.MB[88].DATA.B           /* Message Buffer 88 B Register */
#define CAN_4_H88            CAN_4.MB[88].DATA.H           /* Message Buffer 88 H Register */
#define CAN_4_W88            CAN_4.MB[88].DATA.W           /* Message Buffer 88 W Register */
#define CAN_4_CS89           CAN_4.MB[89].CS.R             /* Message Buffer 89 CS Register */
#define CAN_4_ID89           CAN_4.MB[89].ID.R             /* Message Buffer 89 ID Register */
#define CAN_4_B89            CAN_4.MB[89].DATA.B           /* Message Buffer 89 B Register */
#define CAN_4_H89            CAN_4.MB[89].DATA.H           /* Message Buffer 89 H Register */
#define CAN_4_W89            CAN_4.MB[89].DATA.W           /* Message Buffer 89 W Register */
#define CAN_4_CS90           CAN_4.MB[90].CS.R             /* Message Buffer 90 CS Register */
#define CAN_4_ID90           CAN_4.MB[90].ID.R             /* Message Buffer 90 ID Register */
#define CAN_4_B90            CAN_4.MB[90].DATA.B           /* Message Buffer 90 B Register */
#define CAN_4_H90            CAN_4.MB[90].DATA.H           /* Message Buffer 90 H Register */
#define CAN_4_W90            CAN_4.MB[90].DATA.W           /* Message Buffer 90 W Register */
#define CAN_4_CS91           CAN_4.MB[91].CS.R             /* Message Buffer 91 CS Register */
#define CAN_4_ID91           CAN_4.MB[91].ID.R             /* Message Buffer 91 ID Register */
#define CAN_4_B91            CAN_4.MB[91].DATA.B           /* Message Buffer 91 B Register */
#define CAN_4_H91            CAN_4.MB[91].DATA.H           /* Message Buffer 91 H Register */
#define CAN_4_W91            CAN_4.MB[91].DATA.W           /* Message Buffer 91 W Register */
#define CAN_4_CS92           CAN_4.MB[92].CS.R             /* Message Buffer 92 CS Register */
#define CAN_4_ID92           CAN_4.MB[92].ID.R             /* Message Buffer 92 ID Register */
#define CAN_4_B92            CAN_4.MB[92].DATA.B           /* Message Buffer 92 B Register */
#define CAN_4_H92            CAN_4.MB[92].DATA.H           /* Message Buffer 92 H Register */
#define CAN_4_W92            CAN_4.MB[92].DATA.W           /* Message Buffer 92 W Register */
#define CAN_4_CS93           CAN_4.MB[93].CS.R             /* Message Buffer 93 CS Register */
#define CAN_4_ID93           CAN_4.MB[93].ID.R             /* Message Buffer 93 ID Register */
#define CAN_4_B93            CAN_4.MB[93].DATA.B           /* Message Buffer 93 B Register */
#define CAN_4_H93            CAN_4.MB[93].DATA.H           /* Message Buffer 93 H Register */
#define CAN_4_W93            CAN_4.MB[93].DATA.W           /* Message Buffer 93 W Register */
#define CAN_4_CS94           CAN_4.MB[94].CS.R             /* Message Buffer 94 CS Register */
#define CAN_4_ID94           CAN_4.MB[94].ID.R             /* Message Buffer 94 ID Register */
#define CAN_4_B94            CAN_4.MB[94].DATA.B           /* Message Buffer 94 B Register */
#define CAN_4_H94            CAN_4.MB[94].DATA.H           /* Message Buffer 94 H Register */
#define CAN_4_W94            CAN_4.MB[94].DATA.W           /* Message Buffer 94 W Register */
#define CAN_4_CS95           CAN_4.MB[95].CS.R             /* Message Buffer 95 CS Register */
#define CAN_4_ID95           CAN_4.MB[95].ID.R             /* Message Buffer 95 ID Register */
#define CAN_4_B95            CAN_4.MB[95].DATA.B           /* Message Buffer 95 B Register */
#define CAN_4_H95            CAN_4.MB[95].DATA.H           /* Message Buffer 95 H Register */
#define CAN_4_W95            CAN_4.MB[95].DATA.W           /* Message Buffer 95 W Register */
#define CAN_4_RXIMR0         CAN_4.RXIMR[0].R              /* Rx Individual Mask Registers */
#define CAN_4_RXIMR1         CAN_4.RXIMR[1].R              /* Rx Individual Mask Registers */
#define CAN_4_RXIMR2         CAN_4.RXIMR[2].R              /* Rx Individual Mask Registers */
#define CAN_4_RXIMR3         CAN_4.RXIMR[3].R              /* Rx Individual Mask Registers */
#define CAN_4_RXIMR4         CAN_4.RXIMR[4].R              /* Rx Individual Mask Registers */
#define CAN_4_RXIMR5         CAN_4.RXIMR[5].R              /* Rx Individual Mask Registers */
#define CAN_4_RXIMR6         CAN_4.RXIMR[6].R              /* Rx Individual Mask Registers */
#define CAN_4_RXIMR7         CAN_4.RXIMR[7].R              /* Rx Individual Mask Registers */
#define CAN_4_RXIMR8         CAN_4.RXIMR[8].R              /* Rx Individual Mask Registers */
#define CAN_4_RXIMR9         CAN_4.RXIMR[9].R              /* Rx Individual Mask Registers */
#define CAN_4_RXIMR10        CAN_4.RXIMR[10].R             /* Rx Individual Mask Registers */
#define CAN_4_RXIMR11        CAN_4.RXIMR[11].R             /* Rx Individual Mask Registers */
#define CAN_4_RXIMR12        CAN_4.RXIMR[12].R             /* Rx Individual Mask Registers */
