kbecker0619/StateMachineEngine/components/cwsw_arch_prj/cwsw_arch/MPC57xx/include/MPC5748G_defines_2.h
#define CAN_7_RXIMR13        CAN_7.RXIMR[13].R             /* Rx Individual Mask Registers */
#define CAN_7_RXIMR14        CAN_7.RXIMR[14].R             /* Rx Individual Mask Registers */
#define CAN_7_RXIMR15        CAN_7.RXIMR[15].R             /* Rx Individual Mask Registers */
#define CAN_7_RXIMR16        CAN_7.RXIMR[16].R             /* Rx Individual Mask Registers */
#define CAN_7_RXIMR17        CAN_7.RXIMR[17].R             /* Rx Individual Mask Registers */
#define CAN_7_RXIMR18        CAN_7.RXIMR[18].R             /* Rx Individual Mask Registers */
#define CAN_7_RXIMR19        CAN_7.RXIMR[19].R             /* Rx Individual Mask Registers */
#define CAN_7_RXIMR20        CAN_7.RXIMR[20].R             /* Rx Individual Mask Registers */
#define CAN_7_RXIMR21        CAN_7.RXIMR[21].R             /* Rx Individual Mask Registers */
#define CAN_7_RXIMR22        CAN_7.RXIMR[22].R             /* Rx Individual Mask Registers */
#define CAN_7_RXIMR23        CAN_7.RXIMR[23].R             /* Rx Individual Mask Registers */
#define CAN_7_RXIMR24        CAN_7.RXIMR[24].R             /* Rx Individual Mask Registers */
#define CAN_7_RXIMR25        CAN_7.RXIMR[25].R             /* Rx Individual Mask Registers */
#define CAN_7_RXIMR26        CAN_7.RXIMR[26].R             /* Rx Individual Mask Registers */
#define CAN_7_RXIMR27        CAN_7.RXIMR[27].R             /* Rx Individual Mask Registers */
#define CAN_7_RXIMR28        CAN_7.RXIMR[28].R             /* Rx Individual Mask Registers */
#define CAN_7_RXIMR29        CAN_7.RXIMR[29].R             /* Rx Individual Mask Registers */
#define CAN_7_RXIMR30        CAN_7.RXIMR[30].R             /* Rx Individual Mask Registers */
#define CAN_7_RXIMR31        CAN_7.RXIMR[31].R             /* Rx Individual Mask Registers */
#define CAN_7_RXIMR32        CAN_7.RXIMR[32].R             /* Rx Individual Mask Registers */
#define CAN_7_RXIMR33        CAN_7.RXIMR[33].R             /* Rx Individual Mask Registers */
#define CAN_7_RXIMR34        CAN_7.RXIMR[34].R             /* Rx Individual Mask Registers */
#define CAN_7_RXIMR35        CAN_7.RXIMR[35].R             /* Rx Individual Mask Registers */
#define CAN_7_RXIMR36        CAN_7.RXIMR[36].R             /* Rx Individual Mask Registers */
#define CAN_7_RXIMR37        CAN_7.RXIMR[37].R             /* Rx Individual Mask Registers */
#define CAN_7_RXIMR38        CAN_7.RXIMR[38].R             /* Rx Individual Mask Registers */
#define CAN_7_RXIMR39        CAN_7.RXIMR[39].R             /* Rx Individual Mask Registers */
#define CAN_7_RXIMR40        CAN_7.RXIMR[40].R             /* Rx Individual Mask Registers */
#define CAN_7_RXIMR41        CAN_7.RXIMR[41].R             /* Rx Individual Mask Registers */
#define CAN_7_RXIMR42        CAN_7.RXIMR[42].R             /* Rx Individual Mask Registers */
#define CAN_7_RXIMR43        CAN_7.RXIMR[43].R             /* Rx Individual Mask Registers */
#define CAN_7_RXIMR44        CAN_7.RXIMR[44].R             /* Rx Individual Mask Registers */
#define CAN_7_RXIMR45        CAN_7.RXIMR[45].R             /* Rx Individual Mask Registers */
#define CAN_7_RXIMR46        CAN_7.RXIMR[46].R             /* Rx Individual Mask Registers */
#define CAN_7_RXIMR47        CAN_7.RXIMR[47].R             /* Rx Individual Mask Registers */
#define CAN_7_RXIMR48        CAN_7.RXIMR[48].R             /* Rx Individual Mask Registers */
#define CAN_7_RXIMR49        CAN_7.RXIMR[49].R             /* Rx Individual Mask Registers */
#define CAN_7_RXIMR50        CAN_7.RXIMR[50].R             /* Rx Individual Mask Registers */
#define CAN_7_RXIMR51        CAN_7.RXIMR[51].R             /* Rx Individual Mask Registers */
#define CAN_7_RXIMR52        CAN_7.RXIMR[52].R             /* Rx Individual Mask Registers */
#define CAN_7_RXIMR53        CAN_7.RXIMR[53].R             /* Rx Individual Mask Registers */
#define CAN_7_RXIMR54        CAN_7.RXIMR[54].R             /* Rx Individual Mask Registers */
#define CAN_7_RXIMR55        CAN_7.RXIMR[55].R             /* Rx Individual Mask Registers */
#define CAN_7_RXIMR56        CAN_7.RXIMR[56].R             /* Rx Individual Mask Registers */
#define CAN_7_RXIMR57        CAN_7.RXIMR[57].R             /* Rx Individual Mask Registers */
#define CAN_7_RXIMR58        CAN_7.RXIMR[58].R             /* Rx Individual Mask Registers */
#define CAN_7_RXIMR59        CAN_7.RXIMR[59].R             /* Rx Individual Mask Registers */
#define CAN_7_RXIMR60        CAN_7.RXIMR[60].R             /* Rx Individual Mask Registers */
#define CAN_7_RXIMR61        CAN_7.RXIMR[61].R             /* Rx Individual Mask Registers */
#define CAN_7_RXIMR62        CAN_7.RXIMR[62].R             /* Rx Individual Mask Registers */
#define CAN_7_RXIMR63        CAN_7.RXIMR[63].R             /* Rx Individual Mask Registers */
#define CAN_7_RXIMR64        CAN_7.RXIMR[64].R             /* Rx Individual Mask Registers */
#define CAN_7_RXIMR65        CAN_7.RXIMR[65].R             /* Rx Individual Mask Registers */
#define CAN_7_RXIMR66        CAN_7.RXIMR[66].R             /* Rx Individual Mask Registers */
#define CAN_7_RXIMR67        CAN_7.RXIMR[67].R             /* Rx Individual Mask Registers */
#define CAN_7_RXIMR68        CAN_7.RXIMR[68].R             /* Rx Individual Mask Registers */
#define CAN_7_RXIMR69        CAN_7.RXIMR[69].R             /* Rx Individual Mask Registers */
#define CAN_7_RXIMR70        CAN_7.RXIMR[70].R             /* Rx Individual Mask Registers */
#define CAN_7_RXIMR71        CAN_7.RXIMR[71].R             /* Rx Individual Mask Registers */
#define CAN_7_RXIMR72        CAN_7.RXIMR[72].R             /* Rx Individual Mask Registers */
#define CAN_7_RXIMR73        CAN_7.RXIMR[73].R             /* Rx Individual Mask Registers */
#define CAN_7_RXIMR74        CAN_7.RXIMR[74].R             /* Rx Individual Mask Registers */
#define CAN_7_RXIMR75        CAN_7.RXIMR[75].R             /* Rx Individual Mask Registers */
#define CAN_7_RXIMR76        CAN_7.RXIMR[76].R             /* Rx Individual Mask Registers */
#define CAN_7_RXIMR77        CAN_7.RXIMR[77].R             /* Rx Individual Mask Registers */
#define CAN_7_RXIMR78        CAN_7.RXIMR[78].R             /* Rx Individual Mask Registers */
#define CAN_7_RXIMR79        CAN_7.RXIMR[79].R             /* Rx Individual Mask Registers */
#define CAN_7_RXIMR80        CAN_7.RXIMR[80].R             /* Rx Individual Mask Registers */
#define CAN_7_RXIMR81        CAN_7.RXIMR[81].R             /* Rx Individual Mask Registers */
#define CAN_7_RXIMR82        CAN_7.RXIMR[82].R             /* Rx Individual Mask Registers */
#define CAN_7_RXIMR83        CAN_7.RXIMR[83].R             /* Rx Individual Mask Registers */
#define CAN_7_RXIMR84        CAN_7.RXIMR[84].R             /* Rx Individual Mask Registers */
#define CAN_7_RXIMR85        CAN_7.RXIMR[85].R             /* Rx Individual Mask Registers */
#define CAN_7_RXIMR86        CAN_7.RXIMR[86].R             /* Rx Individual Mask Registers */
#define CAN_7_RXIMR87        CAN_7.RXIMR[87].R             /* Rx Individual Mask Registers */
#define CAN_7_RXIMR88        CAN_7.RXIMR[88].R             /* Rx Individual Mask Registers */
#define CAN_7_RXIMR89        CAN_7.RXIMR[89].R             /* Rx Individual Mask Registers */
#define CAN_7_RXIMR90        CAN_7.RXIMR[90].R             /* Rx Individual Mask Registers */
#define CAN_7_RXIMR91        CAN_7.RXIMR[91].R             /* Rx Individual Mask Registers */
#define CAN_7_RXIMR92        CAN_7.RXIMR[92].R             /* Rx Individual Mask Registers */
#define CAN_7_RXIMR93        CAN_7.RXIMR[93].R             /* Rx Individual Mask Registers */
#define CAN_7_RXIMR94        CAN_7.RXIMR[94].R             /* Rx Individual Mask Registers */
#define CAN_7_RXIMR95        CAN_7.RXIMR[95].R             /* Rx Individual Mask Registers */
#define CAN_7_FDCTRL         CAN_7.FDCTRL.R                /* CAN FD Control Register */
#define CAN_7_FDCBT          CAN_7.FDCBT.R                 /* CAN FD Bit Timing Register */
#define CAN_7_FDCRC          CAN_7.FDCRC.R                 /* CAN FD CRC Register */


// ============================================================================
// ----	Type Definitions ------------------------------------------------------
// ============================================================================

// ============================================================================
// ----	Public Variables ------------------------------------------------------
// ============================================================================

// ============================================================================
// ----	Public API ------------------------------------------------------------
// ============================================================================


#ifdef	__cplusplus
}
#endif

#endif /* CWSW_ARCH_MPC57XX_INCLUDE_MPC5748G_DEFINES_2_H_ */
